[
  {
    "version": "1.5",
    "lastUpdate": "Nov 29, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Frostfell Solstice event calendar"
      },
      {
        "type": "feature",
        "name": "A button to reset all items not currently in a clan bank when transferring"
      },
      {
        "type": "feature",
        "name": "Better loading of the landing page logo and button"
      },
      {
        "type": "feature",
        "name": "Better handling of time-based UI updates"
      },
      {
        "type": "feature",
        "name": "When bank is full, tell which item(s) that are blocking the deposit/gift"
      },
      {
        "type": "bug",
        "name": "Removed NaN after loot progress when being level 99"
      },
      {
        "type": "bug",
        "name": "Tooltip correction in combat when not connected"
      },
      {
        "type": "bug",
        "name": "Removed looping progress bars in the loot modal on mobile due to performance issues"
      },
      {
        "type": "bug",
        "name": "Removed Is Forgeable link in the details modal when opened from the forging page"
      },
      {
        "type": "bug",
        "name": "Fixed scientific notation on abbreviated numbers in some special cases"
      },
      {
        "type": "bug",
        "name": "Missing hand mouse cursor on evolved hero image"
      },
      {
        "type": "bug",
        "name": "Fixed some icons that should not be rounded"
      }
    ]
  },
  {
    "version": "1.4",
    "lastUpdate": "Nov 19, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Can now queue quests while the dependent quest is finished but pending, saving 1 tx"
      },
      {
        "type": "feature",
        "name": "More compact and easier to use item shop when selling items"
      },
      {
        "type": "feature",
        "name": "New quest (for evolved only): So Fletch"
      },
      {
        "type": "feature",
        "name": "Allow sorting by evolved players in the leaderboard"
      },
      {
        "type": "feature",
        "name": "Heroes can now be evolved to unlock unique game features"
      },
      {
        "type": "feature",
        "name": "New item: Flux - To be used in alchemy for evolved heroes"
      },
      {
        "type": "feature",
        "name": "More alchemy: By combining elixium and flux, new items can be created"
      },
      {
        "type": "feature",
        "name": "New skill: Forging along with instant actions to obtain elixium"
      },
      {
        "type": "feature",
        "name": "Notify on clan invites (can be opted out in the settings)"
      },
      {
        "type": "feature",
        "name": "Animated XP progress bar and numbers in the loot modal"
      },
      {
        "type": "feature",
        "name": "Better looking locked actions"
      },
      {
        "type": "feature",
        "name": "Added another collection for special items on the collection page"
      },
      {
        "type": "feature",
        "name": "Better changelog structure for readability"
      },
      {
        "type": "feature",
        "name": "Activity torches also in clan join requests table and on player profile page"
      },
      {
        "type": "feature",
        "name": "Improved popup tooltips behavior, especially for mobile users. Faster and easier to close"
      },
      {
        "type": "feature",
        "name": "More efficient loading of the collection page"
      },
      {
        "type": "feature",
        "name": "New music track by Steven Vinyl - The Tree Below"
      },
      {
        "type": "feature",
        "name": "Animated clan member flames to indicate last activity (with sorting)"
      },
      {
        "type": "feature",
        "name": "Improved menu design for all screen sizes"
      },
      {
        "type": "bug",
        "name": "Now displays output item tooltip for firemaking, cooking and forging"
      },
      {
        "type": "bug",
        "name": "Saving actions no longer fails if the last donation amount happens to be null"
      },
      {
        "type": "bug",
        "name": "Can deselect text after selecting text in the chat and pinned clan message"
      },
      {
        "type": "bug",
        "name": "Collection page items now have a fixed height when loading"
      },
      {
        "type": "bug",
        "name": "Fixed missing margins on the landing page"
      }
    ]
  },
  {
    "version": "1.3",
    "lastUpdate": "Oct 19, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Upgraded Wallet Connect Modal to v3 for better mobile connectivity between browsers/wallets."
      },
      {
        "type": "feature",
        "name": "Added clan contest. First clan to level 20,000 to win boosts!"
      },
      {
        "type": "feature",
        "name": "New LEADER role with the same power as OWNER. Can only be one owner but multiple leaders. All old leaders have become owners."
      },
      {
        "type": "feature",
        "name": "NFT gatekeeping where only players with certain NFTs can join a clan."
      },
      {
        "type": "feature",
        "name": "A new collection page to discover all NFTs owned and not owned. Who will find them all?"
      },
      {
        "type": "feature",
        "name": "Add discord, twitter and/or telegram social links to your hero journal profile"
      },
      {
        "type": "feature",
        "name": "Allow clan leaders to pin a message in their clan"
      },
      {
        "type": "feature",
        "name": "Inventory validation for new and refill boosts (with automatic removal)"
      },
      {
        "type": "feature",
        "name": "Make donation amount default to minimum wishing amount instead of latest donation"
      },
      {
        "type": "feature",
        "name": "Improved edit buttons to handle clan members"
      },
      {
        "type": "feature",
        "name": "Real-time private chat with clan members!"
      },
      {
        "type": "feature",
        "name": "Ability to enable/disable clan join requests (default enabled)"
      },
      {
        "type": "feature",
        "name": "Bulk removal of clan join requests as clan SCOUT or higher"
      },
      {
        "type": "feature",
        "name": "Moved the journal event copy button to app settings (hidden by default)"
      },
      {
        "type": "feature",
        "name": "Better mobile design for clan admin buttons"
      },
      {
        "type": "feature",
        "name": "More journal events related to requests and invites"
      },
      {
        "type": "bug",
        "name": "Allow changing capitilization in hero and clan names without changing the name"
      },
      {
        "type": "bug",
        "name": "No longer zoom in on mobile when focusing on input fields (for compact menu where default zoom is 90%)"
      },
      {
        "type": "bug",
        "name": "Rows no longer highlighted in the wishing well leaderboard table"
      },
      {
        "type": "bug",
        "name": "Corrected margin issue when using 3 input ingredients in crafting/smithing"
      },
      {
        "type": "bug",
        "name": "Use correct UTC time when copying journal events"
      },
      {
        "type": "bug",
        "name": "Rows no longer highlighted in the wishing well leaderboard table"
      },
      {
        "type": "bug",
        "name": "Level required to equip Runite pickaxe changed from 90 to 85"
      },
      {
        "type": "bug",
        "name": "Level required for mining Dragonstone changed from 93 to 95"
      },
      {
        "type": "bug",
        "name": "Corrected item descriptions for Adamantine, Runite and Titanium pickaxes"
      }
    ]
  },
  {
    "version": "1.2",
    "lastUpdate": "Oct 1, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Ability to copy item lists from the journal"
      },
      {
        "type": "feature",
        "name": "New compact optional menu design for better mobile navigation. Activated from the settings panel."
      },
      {
        "type": "feature",
        "name": "Integration for 1kin.io"
      },
      {
        "type": "feature",
        "name": "Display item unit price in the price converter when using multi-quantities"
      },
      {
        "type": "feature",
        "name": "Prioritizing Rabby over Metamask when connecting wallet"
      },
      {
        "type": "feature",
        "name": "Quick-button for selecting own hero in the leaderboard comparison table"
      },
      {
        "type": "feature",
        "name": "Better mobile support for leaderboard, now with comparison tabs! Plus better logic when comparing between skills"
      },
      {
        "type": "feature",
        "name": "Code optimizations: Reduced app bundle size by 50% => faster loading times!"
      },
      {
        "type": "feature",
        "name": "Removed the /game from the URL"
      },
      {
        "type": "feature",
        "name": "Adjusted mechanics: Elemental Dragon drops, Daily/Weekly Reward Pool"
      },
      {
        "type": "feature",
        "name": "Price conversion modal when clicking on BRUSH prices and stats"
      },
      {
        "type": "feature",
        "name": "Better representation of the daily reward tier progress"
      },
      {
        "type": "feature",
        "name": "Changed 'Age' to 'Joined' in clan members table"
      },
      {
        "type": "bug",
        "name": "More stable loading of players when switching wallet accounts, solving 'infinite loading'"
      },
      {
        "type": "bug",
        "name": "Switching wallet account before transactions are confirmed no longer shows wrong action data for the new player"
      },
      {
        "type": "bug",
        "name": "Can now remove action 2 or 3 out of 3 at the same time as adding a new one"
      },
      {
        "type": "bug",
        "name": "Refresh compared heroes even when they are not in the leaderboard table"
      },
      {
        "type": "bug",
        "name": "Better reload of pending XP after looting, no longer falsely unlocking actions"
      },
      {
        "type": "bug",
        "name": "Check if valid BRUSH balance when opening the wishing well page"
      },
      {
        "type": "bug",
        "name": "Corrected combat layout when no player loaded"
      },
      {
        "type": "bug",
        "name": "Removed action panel in wishing well when no player loaded"
      },
      {
        "type": "bug",
        "name": "Better description of fishing equipment"
      }
    ]
  },
  {
    "version": "1.1",
    "lastUpdate": "Sep 10, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Refreshing hero comparison table on the leaderboard page when player stats update"
      },
      {
        "type": "feature",
        "name": "Show exact BRUSH value when click/hover on shop/treasure stats"
      },
      {
        "type": "feature",
        "name": "Added 'Age' column to clan members table"
      },
      {
        "type": "feature",
        "name": "Better clan page with tabs, for less scrolling"
      },
      {
        "type": "feature",
        "name": "Limited Heroes to max 3 per wallet acccount to prevent abuse"
      },
      {
        "type": "feature",
        "name": "Brush logo instead of money bag icon in the footer"
      },
      {
        "type": "feature",
        "name": "Added link to PS brush staking in the menu"
      },
      {
        "type": "feature",
        "name": "More reliable fetching of journal events. No more duplicates"
      },
      {
        "type": "feature",
        "name": "Added background panel to player/clan name in the shop"
      },
      {
        "type": "feature",
        "name": "Added link to PS estfor items in the shop"
      },
      {
        "type": "feature",
        "name": "Increased decimals in paintswap to support smaller listing values"
      },
      {
        "type": "feature",
        "name": "Changed icons of thieving actions"
      },
      {
        "type": "bug",
        "name": "Block enter key in certain input fields that update automatically, less weird behaviour"
      },
      {
        "type": "bug",
        "name": "Linking to PS collection NFT tab now show correct metadata label"
      },
      {
        "type": "bug",
        "name": "Now longer warns about 'item in use' when distributing items from clan"
      },
      {
        "type": "bug",
        "name": "Corrected the monster drops for the bosses"
      },
      {
        "type": "bug",
        "name": "Corrected the ASH output rate in firemaking"
      },
      {
        "type": "bug",
        "name": "Wallets can now only receive 1 daily reward per day regardless of the number of heroes"
      },
      {
        "type": "bug",
        "name": "Fixed the case where 'total food required' exceeded max (65535) when looting after"
      },
      {
        "type": "bug",
        "name": "Added totalSupply() function to PlayerNFT to correctly show total on Ftmscan"
      },
      {
        "type": "bug",
        "name": "Now displaying correct daily reward when leveling up after claiming"
      },
      {
        "type": "bug",
        "name": "Corrected the fighting style icon in the action detail dialog"
      },
      {
        "type": "bug",
        "name": "Queued actions now show in the correct order in the journal"
      },
      {
        "type": "bug",
        "name": "No longer show a 'Deposit to Bank' journal entry in addition to the 'Gifting to Bank' entry"
      },
      {
        "type": "bug",
        "name": "Fixed crash when entered decimal values in certain fields"
      },
      {
        "type": "bug",
        "name": "Resetting approve brush botton state after switching player"
      },
      {
        "type": "bug",
        "name": "Added born hero player name in wallet journal"
      },
      {
        "type": "bug",
        "name": "Exact name matching when checking for available names"
      },
      {
        "type": "bug",
        "name": "Now remembers the refill boost when changing page or player"
      },
      {
        "type": "bug",
        "name": "Can now close both toast messages when two are shown"
      },
      {
        "type": "bug",
        "name": "Fixed inactive buttons properly in inventory"
      },
      {
        "type": "bug",
        "name": "Correct URL when clicking empty quest icon"
      }
    ]
  },
  {
    "version": "1.0",
    "lastUpdate": "",
    "changes": [
      {
        "type": "feature",
        "name": "25th August 2023 - Estfor Kingdom Released!"
      }
    ]
  }
]