[
  {
    "version": "1.14",
    "lastUpdate": "Sep 05, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Anniversary event: A new monster, a chest, a key, a ring and 5 eggs to discover during the 2 week event",
        "lastUpdate": "Aug 25, 2024"
      },
      {
        "type": "feature",
        "name": "New main landing page! Also a loading splash screen, game cursors and reduced (initial) load time by 50%",
        "lastUpdate": "Aug 25, 2024"
      },
      {
        "type": "feature",
        "name": "Removed RPC selection in the app settings. Now automatic polling for the best RPC (including fallback). Can also communicate through the wallet RPC if that's higher ranked.",
        "lastUpdate": "Aug 16, 2024"
      },
      {
        "type": "feature",
        "name": "Migration from Web3.js to Viem/Wagmi for modern functionality and lower app size",
        "lastUpdate": "Aug 16, 2024"
      },
      {
        "type": "feature",
        "name": "Added MMR limit when attacking clan territories",
        "lastUpdate": "Aug 12, 2024"
      },
      {
        "type": "bug",
        "name": "Remember last selected monster when navigating to the monster page",
        "lastUpdate": "Sep 05, 2024"
      },
      {
        "type": "bug",
        "name": "Fixed a bug where clans could not always target all the locked bank vaults in the attack range",
        "lastUpdate": "Aug 30, 2024"
      },
      {
        "type": "bug",
        "name": "Displays correct forging obtain amount (0) when below required set amount",
        "lastUpdate": "Aug 18, 2024"
      },
      {
        "type": "bug",
        "name": "Now displays correct quest progress value (also when completed)",
        "lastUpdate": "Aug 18, 2024"
      }
    ]
  },
  {
    "version": "1.13",
    "lastUpdate": "Jul 26, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Implemented a MMR (MatchMaking Rating) system for clan vault battles",
        "lastUpdate": "Jul 26, 2024"
      },
      {
        "type": "feature",
        "name": "Major re-balance of the HP stats for heroes, equipment and pets. HP bonus now reduces the fish consumption in combat.",
        "lastUpdate": "Jul 26, 2024"
      },
      {
        "type": "feature",
        "name": "Replaced Chainlink VRF with SamWitch VRF for the daily oracle call, fully utilising it in all aspects of Estfor",
        "lastUpdate": "Jul 26, 2024"
      },
      {
        "type": "feature",
        "name": "Removed the Evolved filter from the main leaderboard as it didn't make much sense",
        "lastUpdate": "Jul 26, 2024"
      },
      {
        "type": "feature",
        "name": "Allow typing decimals in the quick swap feature",
        "lastUpdate": "Jul 19, 2024"
      },
      {
        "type": "feature",
        "name": "Upgraded to latest wallet libraries and Li.Fi exchange widget",
        "lastUpdate": "Jul 19, 2024"
      },
      {
        "type": "feature",
        "name": "Better logic when selecting/replacing combat equipment",
        "lastUpdate": "Jul 10, 2024"
      },
      {
        "type": "feature",
        "name": "Design fixes for single item transfer modal",
        "lastUpdate": "Jul 10, 2024"
      },
      {
        "type": "feature",
        "name": "Added dice rolls column to the clan battle warriors table",
        "lastUpdate": "Jul 06, 2024"
      },
      {
        "type": "feature",
        "name": "Better placeholder icons for combat page",
        "lastUpdate": "Jul 06, 2024"
      },
      {
        "type": "feature",
        "name": "Monster drop adjustments: Snapper Bug (10 nature keys/day), Obgora (10 aqua keys/day), Squiggle Egg (10 nature keys/day), Elemental Dragon (dragon chest instead of dragon key), Erkad (bone chest instead of nature key), Bone key and other items dropped from new monsters",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Added rings to be forged into elixium (forging page)",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Fragment system to combine parts into whole items (smithing, crafting and fletching pages)",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Chest and key system to reveal bonus items (thieving page)",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Added 5 new actions in thieving (monster areas)",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Added 15 new actions in woodcutting, mining, fishing that gives multiple output items including dice rolls",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Combat: Added 7 new mountain monsters, ring attachment and arrows with poison/fire effects (poison and brimstone)",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Added 27 new quests",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "New items added: 6 rings, 20 fragments, 17 chests, brimstone and coin",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Transfer different items (or bank distribution) to multiple recipients in one transaction. Also supports splitting a single item into multiple recipients.",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Bulk edit clan member roles",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Better design of the game tips popup, with a disable option",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Show already paid, remaining and refund when editing buy orders in the bazaar",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "feature",
        "name": "Max possible brush price in the Bazaar increased from 1844 to 4722 BRUSH",
        "lastUpdate": "Jul 02, 2024"
      },
      {
        "type": "bug",
        "name": "Poison and Brimstone can now be selected on arrows when having low Range skill",
        "lastUpdate": "Jul 26, 2024"
      },
      {
        "type": "bug",
        "name": "No more overflow issues when cancelling large Bazaar orders",
        "lastUpdate": "Jul 22, 2024"
      },
      {
        "type": "bug",
        "name": "Adjusted to correct background color for hero comparison table",
        "lastUpdate": "Jul 06, 2024"
      },
      {
        "type": "bug",
        "name": "Include non-owned boosts when selecting action boosts",
        "lastUpdate": "Jul 05, 2024"
      },
      {
        "type": "bug",
        "name": "Allow edit player and clan social links without changing the name",
        "lastUpdate": "Jul 02, 2024"
      }
    ]
  },
  {
    "version": "1.12",
    "lastUpdate": "Jun 09, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Optimized contracts for selling in bulk to the store",
        "lastUpdate": "Jun 09, 2024"
      },
      {
        "type": "feature",
        "name": "Bulk invites possible for new clan members",
        "lastUpdate": "Jun 02, 2024"
      },
      {
        "type": "feature",
        "name": "Show timestamps for all changelog entries from this version forward",
        "lastUpdate": "May 28, 2024"
      },
      {
        "type": "feature",
        "name": "Game Tips for new users who haven't discovered certain features yet",
        "lastUpdate": "May 28, 2024"
      },
      {
        "type": "feature",
        "name": "Fully customizable granular journal filters for all events",
        "lastUpdate": "May 28, 2024"
      },
      {
        "type": "feature",
        "name": "Large internal upgrade of wallet integration for better performance and stability",
        "lastUpdate": "May 15, 2024"
      },
      {
        "type": "bug",
        "name": "Cage was mistakenly powerful enough to catch all fish due to a tokenId mismatch. To correct this, Cage and Large Net have been swapped in tokenId. All holders that had one of them (and not both) have been airdropped their counter-part to avoid any fish loss.",
        "lastUpdate": "Jun 03, 2024"
      },
      {
        "type": "bug",
        "name": "Prevent reloading the page when hitting Enter inside input fields",
        "lastUpdate": "Jun 03, 2024"
      },
      {
        "type": "bug",
        "name": "Corrected inconsistency for invalid values in the price converter modal",
        "lastUpdate": "Jun 03, 2024"
      },
      {
        "type": "bug",
        "name": "Now disables accept clan join request button when the clan is full",
        "lastUpdate": "Jun 03, 2024"
      }
    ]
  },
  {
    "version": "1.11",
    "lastUpdate": "May 13, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Removed levelled up infused items from game progress and collection page (kept infused items). Was near impossible to 'complete' the game."
      },
      {
        "type": "feature",
        "name": "Lowered XP rate on all Infused Orichalcum gears"
      },
      {
        "type": "feature",
        "name": "Better text in loot modal when making wish and having winner boost"
      },
      {
        "type": "feature",
        "name": "Warn if hero has a passive action ongoing, if transfer is attempted"
      },
      {
        "type": "feature",
        "name": "Faster API fetching of clan data"
      },
      {
        "type": "feature",
        "name": "Insta-scroll to global stats on the landing page (to avoid stopping too early)"
      },
      {
        "type": "feature",
        "name": "Better color gradients for the progress bars"
      },
      {
        "type":"bug",
        "name":"Forging now visible on the card on the hero load page"
      },
      {
        "type":"bug",
        "name":"Don't select forging items when clicking on their info button"
      },
      {
        "type":"bug",
        "name":"Only show genesis eggs as 'New Item' when looting eggs"
      },
      {
        "type":"bug",
        "name":"Made sure the clan chat is scrolling to the bottom on initial load"
      },
      {
        "type":"bug",
        "name":"Correctly resetting pending passive action if switched account before tx finished"
      },
      {
        "type": "bug",
        "name": "Fixed disabled button when upgrading a clan to higher tier"
      },
      {
        "type": "bug",
        "name": "Visual correction of evolved avatar in item transfer modal"
      },
      {
        "type": "bug",
        "name": "Removed 'you are lvl 0' from weapon stats tooltips"
      },
      {
        "type": "bug",
        "name": "Correctly show if items are missing for the action modal, even for other players"
      },
      {
        "type": "bug",
        "name": "1kin redeem codes works again"
      },
      {
        "type": "bug",
        "name": "Fixed an issue where the send button was disabled when doing single item or pet transfer"
      },
      {
        "type": "bug",
        "name": "Fixed invalid action when saving due to invalid pet ID in special cases"
      },
      {
        "type": "bug",
        "name": "Fixed app crash on certain tooltips when using google translate"
      },
      {
        "type": "bug",
        "name": "Use correct scroll height for mobile modal when selecting equipment/tools/food/pets"
      }
    ]
  },
  {
    "version": "1.10",
    "lastUpdate": "Apr 19, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Egg incubation, hatching and pet farming for combat companions"
      },
      {
        "type": "feature",
        "name": "Added buttons to cancel an active clan join request from 'my clan' and 'requested clan'"
      },
      {
        "type": "feature",
        "name": "Featuring Wormhole USDC.e in the Coin Exchange swap interface"
      },
      {
        "type": "feature",
        "name": "Allow all bazaar trade items to show even when not being connected"
      },
      {
        "type": "feature",
        "name": "Better scrolling behavior in the journal and bazaar tables"
      },
      {
        "type": "feature",
        "name": "Disallowed 25h queueing of actions directly after saving actions. Now available after 1 hour, mostly for having better UI/UX."
      },
      {
        "type": "feature",
        "name": "Reduced BRUSH cost: Boosts and cages in-game shop down by 20%, flux by 50% || Wishing well 12 -> 10 || Editing clan name 500 -> 300 || Evolving hero 1000 -> 700 || Edit hero name 500 -> 300 || Clan upgrades T1 150 -> 100, T2 500 -> 350, T3 2500 -> 2000"
      },
      {
        "type": "feature",
        "name": "When clicking on the order book rows, it will now accumulate the amount of the ones below/above"
      },
      {
        "type": "feature",
        "name": "Expanded forging: 20 new infused items + 20 new upgradeable items with 5 possible levels each. Total 120 new items where 100 can be equipped."
      },
      {
        "type": "feature",
        "name": "More consistent UI when dealing with the attire equipment in combat"
      },
      {
        "type": "feature",
        "name": "Added battle points (D2 rolls) to hero home stat page"
      },
      {
        "type": "feature",
        "name": "Account can now be switched after transfering items without the new grid selection to be cleared when previous transaction finishes"
      },
      {
        "type": "bug",
        "name": "Clicking on any link leading to your own clan will now take you to 'my clan' instead of the leaderboard tab"
      },
      {
        "type": "bug",
        "name": "No longer deselecting P2P trade item when navigating to the same item twice"
      },
      {
        "type": "bug",
        "name": "Correct handling and separation of invalid actions regardless of being finished or pending"
      },
      {
        "type": "bug",
        "name": "Corrected the cooldown used after using Sharpened Claw enchantment on a vault attack. Now 24h cooldown instead of 4 days."
      },
      {
        "type": "bug",
        "name": "Fixed blocking clan invite button on the home page when not being in a clan, but it said so"
      },
      {
        "type": "bug",
        "name": "Removed boost notifications to be shown when other notifications are shown (if already shown)"
      },
      {
        "type": "bug",
        "name": "Columns adjusted in the leaderboard to not get a scrollbar on desktop"
      },
      {
        "type": "bug",
        "name": "Made modal solid background when comparing battle warriors (if using transparent panels)"
      },
      {
        "type": "bug",
        "name": "Wrap long words in the clan's pinned message on mobile to avoid overflowing the screen"
      }
    ]
  },
  {
    "version": "1.9",
    "lastUpdate": "Mar 12, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "12h cooldown added to the clan vault protection shield enchantment (after it runs out, meaning total 48 + 12h until next)"
      },
      {
        "type": "feature",
        "name": "Added helper tooltips to the wallet journal stats panel"
      },
      {
        "type": "feature",
        "name": "Show brush conversion modal in more places"
      },
      {
        "type": "feature",
        "name": "Improved quest descriptions"
      },
      {
        "type": "feature",
        "name": "Displaying more tooltips on the game stat page"
      },
      {
        "type": "feature",
        "name": "Displaying the clan bonus points when evolving hero"
      },
      {
        "type": "feature",
        "name": "Mobile friendly table for the clan battle results"
      },
      {
        "type": "feature",
        "name": "Now includes clan and warrior info in hero load card"
      },
      {
        "type": "feature",
        "name": "Remove trading notification from the menu after visiting the page. Only show when new trades comes in."
      },
      {
        "type": "feature",
        "name": "If LOSING after attacking a locked clan vault you now only lose 5% of your locked funds compared to 10% before"
      },
      {
        "type": "feature",
        "name": "Custom slider to set game panels opacity from within the app settings"
      },
      {
        "type": "feature",
        "name": "Added BRUSH chart link and a button to add token to wallet on the coin exchange page"
      },
      {
        "type": "feature",
        "name": "Better and more consistent selection highlighting of action panels"
      },
      {
        "type": "feature",
        "name": "Display ALL forgable items in the forging page even if locked or not owned, with toggle to show only available"
      },
      {
        "type": "feature",
        "name": "Move the loot modal save button outside the scrolling area for quicker use"
      },
      {
        "type": "bug",
        "name": "Fixed double dice rolls images shown for combat in the journal"
      },
      {
        "type": "bug",
        "name": "Display favorite boosts at the top of the list when selecting them"
      },
      {
        "type": "bug",
        "name": "Made sure to fetch the absolute latest bazaar order table data"
      },
      {
        "type": "bug",
        "name": "Use correct output rate for forging and firemaking"
      },
      {
        "type": "bug",
        "name": "Keeping notification modal and battle result modal full opacity if using transparent panels"
      },
      {
        "type": "bug",
        "name": "Now showing correct BRUSH when clicking on the amount for claimable bazaar orders"
      },
      {
        "type": "bug",
        "name": "Added dice rolls to the journal thieving action"
      },
      {
        "type": "bug",
        "name": "Now displaying correct cooking output amount for all levels"
      }
    ]
  },
  {
    "version": "1.8",
    "lastUpdate": "Mar 4, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Show green notification in menu when trade claimables"
      },
      {
        "type": "feature",
        "name": "Show different colors for bazaar bulk buy vs sell in the item grid"
      },
      {
        "type": "feature",
        "name": "Added hash link to bazaar order table"
      },
      {
        "type": "feature",
        "name": "Faster loading leaderboards and less API fetches in tables when scrolling"
      },
      {
        "type": "feature",
        "name": "Can now search by hero ID in the leaderboard. ID displayed on the hero journal page."
      },
      {
        "type": "feature",
        "name": "Added journal events for claiming locked bank vaults"
      },
      {
        "type": "feature",
        "name": "Support twitter link on clans"
      },
      {
        "type": "feature",
        "name": "Quick-toggle to do daily wish directly in the save actions dialog"
      },
      {
        "type": "feature",
        "name": "Display active hero of a wallet journal, inventory and collection page"
      }, 
      {
        "type": "feature",
        "name": "Optimized clan battle vault table API fetching for faster loading"
      },  
      {
        "type": "feature",
        "name": "Highlight the winner in clan battle result table"
      },
      {
        "type": "feature",
        "name": "Better trade notification link behavior"
      },
      {
        "type": "feature",
        "name": "Better overall UI performance in the Bazaar"
      },
      {
        "type": "feature",
        "name": "Block only owned items checkbox if disconnected"
      },
      {
        "type": "feature",
        "name": "Optimized item grids, favorite icon from item details modal instead"
      },
      {
        "type": "feature",
        "name": "P2P Trading Bazaar with order book for in-game assets"
      },
      {
        "type": "feature",
        "name": "Show your own hero name as green in the leaderboard (same as clans)"
      },
      {
        "type": "feature",
        "name": "Better fit for long names in the journal"
      },
      {
        "type": "feature",
        "name": "Two new quests: Heart Strings and Alchemical Prowess"
      },
      {
        "type": "feature",
        "name": "Faster API fetches of clans and battles, improving the speed of tables and leaderboards"
      },
      {
        "type": "feature",
        "name": "When searching for heroes and clans: Does no longer have to start with the string"
      },
      {
        "type": "bug",
        "name": "Do not show favorite icons for boost details"
      },
      {
        "type": "bug",
        "name": "Did not render the brush icon correct in the bazaar tables on mobile"
      },
      {
        "type": "bug",
        "name": "Now showing correct progress on the global boost icon on the hero stats"
      },
      {
        "type": "bug",
        "name": "No longer using unlooted XP when unlocking forging actions"
      },
      {
        "type": "bug",
        "name": "Don't show claimable bazaar info if disconnected"
      },
      {
        "type": "bug",
        "name": "Navigate to correct forging tab on direct link item id"
      },
      {
        "type": "bug",
        "name": "Now displaying correct territory warrior count when attacking territories"
      },
      {
        "type": "bug",
        "name": "Made sure no more clan and battle results when entering an invalid clan name search"
      }
    ]
  },
  {
    "version": "1.7",
    "lastUpdate": "Feb 9, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Raised the price to create tier 1 clan and reduced the price for tier 2 and 3"
      },
      {
        "type": "feature",
        "name": "New battle enchantment: Sharpened Claw - Allow super attack on vaults for +1 rolls on all warriors"
      },
      {
        "type": "feature",
        "name": "Updated combat algorithm: Battle draws are now counted as win for the attacker instead of defender"
      },
      {
        "type": "feature",
        "name": "Can now sort by bank value in the clan leaderboard"
      },
      {
        "type": "feature",
        "name": "War Cry tweet feature for battle attacks and results"
      },
      {
        "type": "feature",
        "name": "Moved the heroe invites button from clan page to hero page (if having a clan)"
      },
      {
        "type": "feature",
        "name": "Added twitter icon button to each hero in the leaderboard (if set)"
      },
      {
        "type": "feature",
        "name": "Added owned territory to clan page and better design for all the buttons"
      },
      {
        "type": "feature",
        "name": "Better design of the news page with separate panels"
      },
      {
        "type": "feature",
        "name": "Added my current locked vault to battle main panel to avoid scrolling"
      },
      {
        "type": "feature",
        "name": "Changed the tab order on the battle page and better panel design"
      },
      {
        "type": "feature",
        "name": "Now highligting your owned territory and moved it first in the list for faster harvesting"
      },
      {
        "type": "feature",
        "name": "More consistent use of brush icons in the journal that also opens the price modal"
      },
      {
        "type": "feature",
        "name": "Any evolved hero now gets +1 on the max points on all skills in battle"
      },
      {
        "type": "feature",
        "name": "Added won brush to the battle report table"
      },
      {
        "type": "feature",
        "name": "My Warriors button is now also displayed on the clan page"
      },
      {
        "type": "feature",
        "name": "The latest clan tab is now remembered"
      },
      {
        "type": "feature",
        "name": "Better territory page design for shaking the tree. Now displaying the emitted brush all the time."
      },
      {
        "type": "feature",
        "name": "Clan battles with territories and BRUSH rewards!"
      },
      {
        "type": "feature",
        "name": "Custom filters on all journal pages"
      },
      {
        "type": "feature",
        "name": "Collection page: Self minted NFTs are now tracked per hero. Plus a collection of the account inventory."
      },
      {
        "type": "feature",
        "name": "Search items by name in the inventory and a toggle for grid size"
      },
      {
        "type": "feature",
        "name": "A direct link to bulk list items on PaintSwap from the inventory"
      },
      {
        "type": "feature",
        "name": "24hr cooldown before a hero can be activated after being transferred to an account with boosts"
      },
      {
        "type": "feature",
        "name": "Tabs in the app settings dialog"
      },
      {
        "type": "bug",
        "name": "Using better vault sorting when there is unclaimed brush"
      },
      {
        "type": "bug",
        "name": "Fixed sort order for vault PvP leaderboard and the skill level sorting in battle result table"
      },
      {
        "type": "bug",
        "name": "Avoid loading wrong journal before loading the real one"
      },
      {
        "type": "bug",
        "name": "Fixed incorrectly shown 'ready to disperse' on the battle page when not connected"
      },
      {
        "type": "bug",
        "name": "Removed a bad API call on the clan page"
      },
      {
        "type": "bug",
        "name": "Avoid navigating to wrong clan tab after leaving a clan"
      },
      {
        "type": "bug",
        "name": "The order of heroes vs points are now correct in the battle results"
      },
      {
        "type": "bug",
        "name": "Any clan member can harvest territory owned by their clan now"
      },
      {
        "type": "bug",
        "name": "Can now reattack vaults using devilish finger enchantment"
      },
      {
        "type": "bug",
        "name": "Avoid crash when comparing warriors without a hero"
      },
      {
        "type": "bug",
        "name": "The selected battle enchantments are now cleared properly if switching hero"
      }
    ]
  },
  {
    "version": "1.6",
    "lastUpdate": "Jan 19, 2024",
    "changes": [
      {
        "type": "feature",
        "name": "Now also possible to sell brush in the quick swap modal"
      },
      {
        "type": "feature",
        "name": "Extra warning that equipment may change when changing weapon type"
      },
      {
        "type": "feature",
        "name": "Swapped the order of combat Stats and Equipment, making Equipment the default"
      },
      {
        "type": "feature",
        "name": "Landing page QRNG partner"
      },
      {
        "type": "feature",
        "name": "Clean up of contests and a new contest page for past and currently running"
      },
      {
        "type": "feature",
        "name": "Better overall API stability"
      },
      {
        "type": "feature",
        "name": "A global error boundry to catch app crashes and with reporting instructions"
      },
      {
        "type": "feature",
        "name": "More consistent item sorting in the shop, inventory and collection pages"
      },
      {
        "type": "bug",
        "name": "Correctly loading new hero ID after minting a new hero"
      },
      {
        "type": "bug",
        "name": "Include the new level when leveling up in loot modal on mobile devices"
      },
      {
        "type": "bug",
        "name": "Clickable wallets in wishing well leaderboard"
      },
      {
        "type": "bug",
        "name": "Clan upgrade button now disabled when not connected"
      },
      {
        "type": "bug",
        "name": "Better account and balance handling in the coin exchange"
      },
      {
        "type": "bug",
        "name": "The leaderboard sub tabs on mobile no longer shared with the clan page tabs"
      }
    ]
  },
  {
    "version": "1.5",
    "lastUpdate": "Dec 6, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "A new built-in crypto swap / bridge powered by LI.FI"
      },
      {
        "type": "feature",
        "name": "Custom sortable clan invites and join requests tables"
      },
      {
        "type": "feature",
        "name": "A new crypto wallet tutorial for beginners if not yet connected"
      },
      {
        "type": "feature",
        "name": "Two new quests: 'Enter the veil' and 'Forge Ahead"
      },
      {
        "type": "feature",
        "name": "Allow queuing up to 24h 59min and 59sec instead of 23h 59min and 59sec when having running actions"
      },
      {
        "type": "feature",
        "name": "Hiding 'Self Made' from special collecion items since some can't be crafted on same account"
      },
      {
        "type": "feature",
        "name": "Extra hover tooltip for hero stats to show active heroes today"
      },
      {
        "type": "feature",
        "name": "Toggle born / active hero statistics from normal to evolved"
      },
      {
        "type": "feature",
        "name": "More efficient snowfall and landing page on slower hardware"
      },
      {
        "type": "feature",
        "name": "Frostfell Solstice event calendar"
      },
      {
        "type": "feature",
        "name": "A button to reset all items not currently in a clan bank when transferring"
      },
      {
        "type": "feature",
        "name": "Better loading of the landing page logo and button"
      },
      {
        "type": "feature",
        "name": "Better handling of time-based UI updates"
      },
      {
        "type": "feature",
        "name": "When bank is full, tell which item(s) that are blocking the deposit/gift"
      },
      {
        "type": "bug",
        "name": "Show final XP progress bar when reaching level 100 in the loot modal"
      },
      {
        "type": "bug",
        "name": "Hide the X multiplier in the item name for smithing arrow heads"
      },
      {
        "type": "bug",
        "name": "No more showing 'hero already invited' when typing hero ID in the invite field"
      },
      {
        "type": "bug",
        "name": "Modal height adjustments for better mobile experience"
      },
      {
        "type": "bug",
        "name": "Missing scroll for combat items in the journal when dice rolls also included"
      },
      {
        "type": "bug",
        "name": "Removed NaN after loot progress when being level 99"
      },
      {
        "type": "bug",
        "name": "Tooltip correction in combat when not connected"
      },
      {
        "type": "bug",
        "name": "Removed looping progress bars in the loot modal on mobile due to performance issues"
      },
      {
        "type": "bug",
        "name": "Removed Is Forgeable link in the details modal when opened from the forging page"
      },
      {
        "type": "bug",
        "name": "Fixed scientific notation on abbreviated numbers in some special cases"
      },
      {
        "type": "bug",
        "name": "Missing hand mouse cursor on evolved hero image"
      },
      {
        "type": "bug",
        "name": "Fixed some icons that should not be rounded"
      }
    ]
  },
  {
    "version": "1.4",
    "lastUpdate": "Nov 19, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Can now queue quests while the dependent quest is finished but pending, saving 1 tx"
      },
      {
        "type": "feature",
        "name": "More compact and easier to use item shop when selling items"
      },
      {
        "type": "feature",
        "name": "New quest (for evolved only): So Fletch"
      },
      {
        "type": "feature",
        "name": "Allow sorting by evolved heroes in the leaderboard"
      },
      {
        "type": "feature",
        "name": "Heroes can now be evolved to unlock unique game features"
      },
      {
        "type": "feature",
        "name": "New item: Flux - To be used in alchemy for evolved heroes"
      },
      {
        "type": "feature",
        "name": "More alchemy: By combining elixium and flux, new items can be created"
      },
      {
        "type": "feature",
        "name": "New skill: Forging along with instant actions to obtain elixium"
      },
      {
        "type": "feature",
        "name": "Notify on clan invites (can be opted out in the settings)"
      },
      {
        "type": "feature",
        "name": "Animated XP progress bar and numbers in the loot modal"
      },
      {
        "type": "feature",
        "name": "Better looking locked actions"
      },
      {
        "type": "feature",
        "name": "Added another collection for special items on the collection page"
      },
      {
        "type": "feature",
        "name": "Better changelog structure for readability"
      },
      {
        "type": "feature",
        "name": "Activity torches also in clan join requests table and on hero profile page"
      },
      {
        "type": "feature",
        "name": "Improved popup tooltips behavior, especially for mobile users. Faster and easier to close"
      },
      {
        "type": "feature",
        "name": "More efficient loading of the collection page"
      },
      {
        "type": "feature",
        "name": "New music track by Steven Vinyl - The Tree Below"
      },
      {
        "type": "feature",
        "name": "Animated clan member flames to indicate last activity (with sorting)"
      },
      {
        "type": "feature",
        "name": "Improved menu design for all screen sizes"
      },
      {
        "type": "bug",
        "name": "Now displays output item tooltip for firemaking, cooking and forging"
      },
      {
        "type": "bug",
        "name": "Saving actions no longer fails if the last donation amount happens to be null"
      },
      {
        "type": "bug",
        "name": "Can deselect text after selecting text in the chat and pinned clan message"
      },
      {
        "type": "bug",
        "name": "Collection page items now have a fixed height when loading"
      },
      {
        "type": "bug",
        "name": "Fixed missing margins on the landing page"
      }
    ]
  },
  {
    "version": "1.3",
    "lastUpdate": "Oct 19, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Upgraded Wallet Connect Modal to v3 for better mobile connectivity between browsers/wallets."
      },
      {
        "type": "feature",
        "name": "Added clan contest. First clan to level 20,000 to win boosts!"
      },
      {
        "type": "feature",
        "name": "New LEADER role with the same power as OWNER. Can only be one owner but multiple leaders. All old leaders have become owners."
      },
      {
        "type": "feature",
        "name": "NFT gatekeeping where only heroes with certain NFTs can join a clan."
      },
      {
        "type": "feature",
        "name": "A new collection page to discover all NFTs owned and not owned. Who will find them all?"
      },
      {
        "type": "feature",
        "name": "Add discord, twitter and/or telegram social links to your hero journal profile"
      },
      {
        "type": "feature",
        "name": "Allow clan leaders to pin a message in their clan"
      },
      {
        "type": "feature",
        "name": "Inventory validation for new and refill boosts (with automatic removal)"
      },
      {
        "type": "feature",
        "name": "Make donation amount default to minimum wishing amount instead of latest donation"
      },
      {
        "type": "feature",
        "name": "Improved edit buttons to handle clan members"
      },
      {
        "type": "feature",
        "name": "Real-time private chat with clan members!"
      },
      {
        "type": "feature",
        "name": "Ability to enable/disable clan join requests (default enabled)"
      },
      {
        "type": "feature",
        "name": "Bulk removal of clan join requests as clan SCOUT or higher"
      },
      {
        "type": "feature",
        "name": "Moved the journal event copy button to app settings (hidden by default)"
      },
      {
        "type": "feature",
        "name": "Better mobile design for clan admin buttons"
      },
      {
        "type": "feature",
        "name": "More journal events related to requests and invites"
      },
      {
        "type": "bug",
        "name": "Allow changing capitilization in hero and clan names without changing the name"
      },
      {
        "type": "bug",
        "name": "No longer zoom in on mobile when focusing on input fields (for compact menu where default zoom is 90%)"
      },
      {
        "type": "bug",
        "name": "Rows no longer highlighted in the wishing well leaderboard table"
      },
      {
        "type": "bug",
        "name": "Corrected margin issue when using 3 input ingredients in crafting/smithing"
      },
      {
        "type": "bug",
        "name": "Use correct UTC time when copying journal events"
      },
      {
        "type": "bug",
        "name": "Rows no longer highlighted in the wishing well leaderboard table"
      },
      {
        "type": "bug",
        "name": "Level required to equip Runite pickaxe changed from 90 to 85"
      },
      {
        "type": "bug",
        "name": "Level required for mining Dragonstone changed from 93 to 95"
      },
      {
        "type": "bug",
        "name": "Corrected item descriptions for Adamantine, Runite and Titanium pickaxes"
      }
    ]
  },
  {
    "version": "1.2",
    "lastUpdate": "Oct 1, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Ability to copy item lists from the journal"
      },
      {
        "type": "feature",
        "name": "New compact optional menu design for better mobile navigation. Activated from the settings panel."
      },
      {
        "type": "feature",
        "name": "Integration for 1kin.io"
      },
      {
        "type": "feature",
        "name": "Display item unit price in the price converter when using multi-quantities"
      },
      {
        "type": "feature",
        "name": "Prioritizing Rabby over Metamask when connecting wallet"
      },
      {
        "type": "feature",
        "name": "Quick-button for selecting own hero in the leaderboard comparison table"
      },
      {
        "type": "feature",
        "name": "Better mobile support for leaderboard, now with comparison tabs! Plus better logic when comparing between skills"
      },
      {
        "type": "feature",
        "name": "Code optimizations: Reduced app bundle size by 50% => faster loading times!"
      },
      {
        "type": "feature",
        "name": "Removed the /game from the URL"
      },
      {
        "type": "feature",
        "name": "Adjusted mechanics: Elemental Dragon drops, Daily/Weekly Reward Pool"
      },
      {
        "type": "feature",
        "name": "Price conversion modal when clicking on BRUSH prices and stats"
      },
      {
        "type": "feature",
        "name": "Better representation of the daily reward tier progress"
      },
      {
        "type": "feature",
        "name": "Changed 'Age' to 'Joined' in clan members table"
      },
      {
        "type": "bug",
        "name": "More stable loading of heroes when switching wallet accounts, solving 'infinite loading'"
      },
      {
        "type": "bug",
        "name": "Switching wallet account before transactions are confirmed no longer shows wrong action data for the new hero"
      },
      {
        "type": "bug",
        "name": "Can now remove action 2 or 3 out of 3 at the same time as adding a new one"
      },
      {
        "type": "bug",
        "name": "Refresh compared heroes even when they are not in the leaderboard table"
      },
      {
        "type": "bug",
        "name": "Better reload of pending XP after looting, no longer falsely unlocking actions"
      },
      {
        "type": "bug",
        "name": "Check if valid BRUSH balance when opening the wishing well page"
      },
      {
        "type": "bug",
        "name": "Corrected combat layout when no hero loaded"
      },
      {
        "type": "bug",
        "name": "Removed action panel in wishing well when no hero loaded"
      },
      {
        "type": "bug",
        "name": "Better description of fishing equipment"
      }
    ]
  },
  {
    "version": "1.1",
    "lastUpdate": "Sep 10, 2023",
    "changes": [
      {
        "type": "feature",
        "name": "Refreshing hero comparison table on the leaderboard page when hero stats update"
      },
      {
        "type": "feature",
        "name": "Show exact BRUSH value when click/hover on shop/treasure stats"
      },
      {
        "type": "feature",
        "name": "Added 'Age' column to clan members table"
      },
      {
        "type": "feature",
        "name": "Better clan page with tabs, for less scrolling"
      },
      {
        "type": "feature",
        "name": "Limited Heroes to max 3 per wallet acccount to prevent abuse"
      },
      {
        "type": "feature",
        "name": "Brush logo instead of money bag icon in the footer"
      },
      {
        "type": "feature",
        "name": "Added link to PS brush staking in the menu"
      },
      {
        "type": "feature",
        "name": "More reliable fetching of journal events. No more duplicates"
      },
      {
        "type": "feature",
        "name": "Added background panel to hero/clan name in the shop"
      },
      {
        "type": "feature",
        "name": "Added link to PS estfor items in the shop"
      },
      {
        "type": "feature",
        "name": "Increased decimals in paintswap to support smaller listing values"
      },
      {
        "type": "feature",
        "name": "Changed icons of thieving actions"
      },
      {
        "type": "bug",
        "name": "Block enter key in certain input fields that update automatically, less weird behaviour"
      },
      {
        "type": "bug",
        "name": "Linking to PS collection NFT tab now show correct metadata label"
      },
      {
        "type": "bug",
        "name": "Now longer warns about 'item in use' when distributing items from clan"
      },
      {
        "type": "bug",
        "name": "Corrected the monster drops for the bosses"
      },
      {
        "type": "bug",
        "name": "Corrected the ASH output rate in firemaking"
      },
      {
        "type": "bug",
        "name": "Wallets can now only receive 1 daily reward per day regardless of the number of heroes"
      },
      {
        "type": "bug",
        "name": "Fixed the case where 'total food required' exceeded max (65535) when looting after"
      },
      {
        "type": "bug",
        "name": "Added totalSupply() function to PlayerNFT to correctly show total on Ftmscan"
      },
      {
        "type": "bug",
        "name": "Now displaying correct daily reward when leveling up after claiming"
      },
      {
        "type": "bug",
        "name": "Corrected the fighting style icon in the action detail dialog"
      },
      {
        "type": "bug",
        "name": "Queued actions now show in the correct order in the journal"
      },
      {
        "type": "bug",
        "name": "No longer show a 'Deposit to Bank' journal entry in addition to the 'Gifting to Bank' entry"
      },
      {
        "type": "bug",
        "name": "Fixed crash when entered decimal values in certain fields"
      },
      {
        "type": "bug",
        "name": "Resetting approve brush botton state after switching hero"
      },
      {
        "type": "bug",
        "name": "Added born hero hero name in wallet journal"
      },
      {
        "type": "bug",
        "name": "Exact name matching when checking for available names"
      },
      {
        "type": "bug",
        "name": "Now remembers the refill boost when changing page or hero"
      },
      {
        "type": "bug",
        "name": "Can now close both toast messages when two are shown"
      },
      {
        "type": "bug",
        "name": "Fixed inactive buttons properly in inventory"
      },
      {
        "type": "bug",
        "name": "Correct URL when clicking empty quest icon"
      }
    ]
  },
  {
    "version": "1.0",
    "lastUpdate": "",
    "changes": [
      {
        "type": "feature",
        "name": "25th August 2023 - Estfor Kingdom Released!"
      }
    ]
  }
]